Revit 2027 API
ContinuousRail.GetPath Method
 Retrieves the rail path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetPath()
Public Function GetPath As IList(Of Curve)
public:
IList<Curve^>^ GetPath()
member GetPath : unit -> IList<Curve>
Return Value
IList<Curve>
 The path of the rail.
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace